<template>
  <div class="container content flex justify-between">
    <div class="left-side">
      <h1>История компании</h1>
      <h2>ПОДЗАГОЛОВОК 1</h2>
      <h2>ПОДЗАГОЛОВОК 2</h2>
      <h2>ПОДЗАГОЛОВОК 3</h2>
    </div>
    <div class="right-side">
      <span><router-link to="/">НАЗАД</router-link></span>
      <img class="first-img" src="/src/assets/image/history/cat.png" alt="" />
      <div class="subtitle-1">
        <h2>Подзаголовок 1</h2>
        <p>
          Терапия - область гуманной и ветеринарной медицины, занимающаяся
          непосредлственно лечением патологий, облегчением состояния больного и
          устранением симптомов заболеваний.
        </p>
        <p>
          Терапевтическое отделение клиники Айболит занимается диагностикой и
          лечением следующих болезней.
        </p>
        <ul>
          <li>- органов пищеварения;</li>
          <li>- органов сердечно-сосудистой системы;</li>
          <li>- органов дыхательной системы;</li>
          <li>- нервной системы;</li>
          <li>- органов мочевыделительной системы;</li>
          <li>- эндокринной системы;</li>
          <li>- нарушения обмена веществ;</li>
          <li>- кожи и её производных;</li>
          <li>- органов чувств;</li>
          <li>- репродуктивной области;</li>
          <li>- инфекционной и инвазионной природы;</li>
          <li>- токсикологический природы;</li>
        </ul>
      </div>
      <div class="subtitle-2">
        <h2>Подзаголовок 2</h2>
        <p>
          В нашей клинике имеются как врачи-терапевты общей практики, так и
          узкие специалисты по ряду перечисленных областей, что дает возможность
          излечивать тяжелые и редкие случаи патологий.
        </p>
        <div class="subtitle-2__image flex justify-between">
          <img src="/src/assets/image/history/cat2.png" alt="" />
          <img src="/src/assets/image/history/dog.png" alt="" />
        </div>
        <p>
          Врач-терапевт подходит к лечению животного комплексно, предварительно
          изучив его анамнез, учитывая возраст, пол, породу, наличие хронических
          болезней, условия содержания, типа кормления, оценив общее состояние
          питомца, полностью осмотрев его и назначив необходимую диагностику и
          соответствующее лечение.
        </p>
        <p>
          Врачи клиники имеют широкий спектр диагностических возможностей, что
          является идеальным условием для постановки точного диагноза, а значит
          и назначения того лечения, которое наиболее эффективно справится с
          данным конкретным клиническим случаем.
        </p>
        <p>
          Некоторую диагностику можно провести тут же на месте в течение
          буквально нескольких минут, что немаловажно для экстренных случаев и
          значительно экономят время владельцам:
        </p>
        <ul>
          <li>- гематологический и биохимический анализы крови;</li>
          <li>- исследование Т4 и кортизол;</li>
          <li>- анализ газов крови;</li>
          <li>- рентген;</li>
          <li>- ультразвуковое исследование брюшной полости и сердца;</li>
          <li>- микроскопия мазков и соскобов;</li>
          <li>- люминесцентный тест на лишай;</li>
          <li>- экспресс-анализы на основные вирусные заболевания.</li>
        </ul>
      </div>
      <div class="subtitle-3">
        <h2>Подзаголовок 3</h2>
        <p>
          Большинство исследований, требующих седации (эндоскопия, МРТ,
          лапароскопия), так же доступны в течение суток. Более сложные анализы,
          такие как бактериологический посев, гормоны, гистологическое
          исследование мы направляем в дистанционную лабораторию.
        </p>
        <p>
          Получив результаты исследований врач приступает к анализу причин и
          механизмов развития болезни и назначает лечение. Оно может быть
          медикаментозным (домашним или стационарным) или оперативным
          (экстренным или плановым).
        </p>
        <p>
          Эффективность терапии в большой степени зависит и от владельца
          животного, ведь именно ему необходимо будет соблюдать предписания
          врача, вовремя давать препараты или ставить уколы, следить за
          развитием динамики и симптомов, чтобы вовремя оповестить врача о
          происходящих изменениях, для своевременной коррекции лечения.
        </p>
        <p>
          Кроме лечения терапевты занимаются и профилактикой заболеваний.
          Доктора с удовольствием расскажут вам основы выращивания, содержания и
          кормления питомца, графики дегельминтизаций и прививок. Оформят
          ветеринарный паспорт и чипируют ваше животное.
        </p>
      </div>
    </div>
  </div>
</template>
<style lang="scss" scoped>
@import "/src/assets/styles/main.scss";
.content {
  padding-top: 150px;
  padding-bottom: 100px;
}
.left-side {
  h1 {
    font-size: 80px;
    line-height: 110px;
    max-width: 220px;
    margin-bottom: 100px;
  }
  h2 {
    font-size: 20px;
    color: #c3b9b5;
    margin-bottom: 30px;
  }
}
.right-side {
  position: relative;
  max-width: 909px;
  span {
    position: absolute;
    display: block;
    color: $orange-color;
    font-size: 20px;
    padding-left: 20px;
    top: -70px;

    &::before {
      content: "";
      top: 35%;
      left: 0;
      position: absolute;
      display: inline-block;
      border-left: 2px solid $orange-color;
      border-bottom: 2px solid $orange-color;
      width: 11px;
      height: 11px;
      transform: rotate(45deg);
    }
  }
  h2 {
    font-size: 30px;
    margin-bottom: 30px;
  }
  p {
    font-size: 20px;
    font-style: italic;
    margin-bottom: 20px;
  }
  ul {
    margin-bottom: 20px;
  }
  li {
    font-size: 20px;
    font-style: italic;
  }
  img {
    margin-bottom: 30px;
  }
}
</style>
